In [1]:
import numpy as np
import pandas as pd

# Creating Series Using pandas:

converting list,numpy array, dictionary to a series:

In [2]:
labels=['a','b','c']
my_list=[10,20,30]
arr=np.array([30,40,50])
d={'a':10,'b':20,'c':30}

In [58]:
pd.Series(data=my_list) # Series is inbuilt class we are cerating constructor of series class # also class name is written in Caps it is not function

0    10
1    20
2    30
dtype: int64

In [59]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [60]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

In [61]:
pd.Series(arr)

0    30
1    40
2    50
dtype: int32

In [62]:
pd.Series(arr,labels)

a    30
b    40
c    50
dtype: int32

In [63]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [64]:
ser1 = pd.Series([1,2,3,4],index=['USA','Germany','USSR','Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [10]:
ser2 = pd.Series([1,2,5,4],index=['USA','Germany','Italy','Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [11]:
ser1['USA'] # it prints entire row

1

In [65]:
ser2['Italy'] # in dataset columns used to display but here it is displaying row

5

In [13]:
ser1 + ser2 # addition is happening element-wise

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [14]:
ser1 * ser2

Germany     4.0
Italy       NaN
Japan      16.0
USA         1.0
USSR        NaN
dtype: float64

# Operations

In [66]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']}) 
df # Series constructor will keep row names | DataFrame constructor will keep column names

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [16]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [70]:
df['col2']

0    444
1    555
2    666
3    444
Name: col2, dtype: int64

In [72]:
df[['col1','col2']]

   col1  col2
0     1   444
1     2   555
2     3   666
3     4   444

In [69]:
df['col3'][df['col2']==444]

0    abc
3    xyz
Name: col3, dtype: object

In [18]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [19]:
df['col2'].nunique()

3

In [20]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [21]:
df['col1'] > 2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [22]:
df[df['col1'] > 2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [23]:
df['col2'] == 444

0     True
1    False
2    False
3     True
Name: col2, dtype: bool

In [24]:
df[df['col2'] == 444]

   col1  col2 col3
0     1   444  abc
3     4   444  xyz

In [25]:
df[(df['col1'] > 2 ) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

# Applying_Functions

In [26]:
def square(x):
    return x**2

In [27]:
def times2(y):
    return y*2

In [28]:
df['col1'].apply(square)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [29]:
df['col3'].apply(times2)

0    abcabc
1    defdef
2    ghighi
3    xyzxyz
Name: col3, dtype: object

In [30]:
df['col3'].apply(len) # on each element operation happens

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [75]:
len(df['col3']) # happens for complete column

4

In [31]:
df['col3'].sum()

'abcdefghixyz'

In [32]:
del df['col1']

In [33]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [34]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [35]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [36]:
df.sort_values(by='col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [37]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [38]:
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [39]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],'col2':[np.nan,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [40]:
df.isnull()

    col1   col2   col3
0  False   True  False
1  False  False  False
2  False  False  False
3   True  False  False

In [41]:
df.fillna('Empty')

    col1   col2 col3
0      1  Empty  abc
1      2    555  def
2      3    666  ghi
3  Empty    444  xyz

In [109]:
data= {'a':['foo','foo','foo','bar','bar','bar'],'b':['one','one','two','two','one','one'],'c':['x','y','x','y','x','y'],'d':[1,3,2,5,4,1]}
df = pd.DataFrame(data)

In [110]:
df

     a    b  c  d
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [113]:
df.pivot_table(values=['d'],index=['a','b'] ,columns=['c'])

           d
c          x    y
a   b
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [114]:
df.pivot_table(values='d',index=['a','c'] ,columns=['b'])

b      one  two
a   c
bar x  4.0  NaN
    y  1.0  5.0
foo x  1.0  2.0
    y  3.0  NaN

# Groupby

In [115]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],'Sales':[200,120,340,124,243,350]}

In [116]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [117]:
df.pivot_table(values='Sales',index=['Company'] ,columns=['Person'])

Person     Amy   Carl  Charlie    Sam  Sarah  Vanessa
Company
FB         NaN  243.0      NaN    NaN  350.0      NaN
GOOG       NaN    NaN    120.0  200.0    NaN      NaN
MSFT     340.0    NaN      NaN    NaN    NaN    124.0

In [86]:
df.groupby('Company')

In [87]:
by_comp = df.groupby('Company')

In [88]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [89]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [90]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [91]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [92]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [93]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [94]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [95]:
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [97]:
sales_report=by_comp.describe().transpose()
sales_report

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [99]:
sales_report.to_csv('new_sales_report.csv') # creating our own csv after calculations

In [100]:
sales_report.to_excel('new_sales_report.xlsx')

# location loc and index_location iloc

In [103]:
df=pd.DataFrame([1,2,3,4,5,6,7,8,9,10],index=[49,48,47,46,45,1,2,3,4,5])
df

     0
49   1
48   2
47   3
46   4
45   5
1    6
2    7
3    8
4    9
5   10

In [107]:
#df.loc[0]  # it is KeyError  beacuse there is no index called 0 in which we have kept

In [105]:
df.loc[49] # locates as per the index we have kept

0    1
Name: 49, dtype: int64

In [106]:
df.iloc[0] # locates as per index of program that is it follows number system (0,1,2,3...)

0    1
Name: 49, dtype: int64